import streamlit as st

st.set_page_config(layout="wide")

page = st.sidebar.radio(
    "القائمة",
    [
        "تحليل العميل",
        "تعليمات Axis",
        "العملاء عالية المخاطر"
    ]
)


# =====================
# صفحة التحليل
# =====================
if page == "تحليل العميل":

    st.title("📋 Axis Wallet Assistant")

    name = st.text_input("الاسم")

    national_id = st.text_input("الرقم القومي")

    job = st.text_input("المهنة")

    age = st.number_input("السن", 1, 120)

    if st.button("تحليل العميل"):

        if age >= 60:
            workplace = "معاش"

        elif job == "ربة منزل":
            workplace = "شخص درجة أولى"

        elif job in ["عامل", "سائق", "فلاح"]:
            workplace = "حر"

        else:
            workplace = job

        st.success(f"جهة العمل: {workplace}")


# =====================
# صفحة التعليمات
# =====================
elif page == "تعليمات Axis":

    st.title("📚 تعليمات Axis")

    st.markdown("""
### مصدر الدخل

- كبار السن بدون وظيفة = معاش
- ربة منزل = أحد أقارب الدرجة الأولى
- طالب = أحد أقارب الدرجة الأولى
- خريج = أحد أقارب الدرجة الأولى

### الجنسية

- وجود 88 في الرقم القومي = جنسية أخرى

### محل الميلاد

- يكتب اسم المحافظة فقط
""")


# =====================
# صفحة المخاطر
# =====================
elif page == "العملاء عالية المخاطر":

    st.title("⚠ العملاء عالية المخاطر")

    st.markdown("""
- جيش
- عسكري
- ضابط
- قاضي
- محام
- رجل دين
- سياسي
- دبلوماسي
- تاجر ذهب
- ألماس
- مجوهرات
- كازينو
- قمار
- وكيل عقارات
""")
